Repository: dmitrypsc/windows10-showcase
Catalog: SensorbergShowcase/Strings/*/Resources.resw
Source language: en_us
Languages: fi_fi

# advertise.Text
source: advertise
fi_fi: lähetys

# apiKey.Text
source: API key
fi_fi: API-avain

# apiKeyIsValid.Text
source: API key is valid
fi_fi: API-avain on kelvollinen

# apiKeyNotValidated.Text
source: API key not validated
fi_fi: API-avain ei ole kelvollinen

# apiKeyValidationFailedDueToNetworkError.Text
source: Failed to validate the API key due to a possible network error.
fi_fi: API-avaimen tarkistus epäonnistui yhteysvirheen vuoksi.

# authenticationFailedForFetchingApiKey.Text
source: Authentication failed. Please check your email address and password.
fi_fi: Todennus epäonnistui. Ole hyvä ja tarkasta sähköpostiosoite ja salasana.

# backgroundTask.Text
source: Background task
fi_fi: Tausta-ajo

# backgroundTaskFiltersUpdated.Text
source: Background task filters updated successfully with the new beacon identifiers
fi_fi: Tausta-ajon beacon-tunnisteet päivitetty onnistuneesti

# beaconActions.Text
source: Beacon actions
fi_fi: Beacon-toimenpiteet

# checkStatus.Label
source: check status
fi_fi: tarkista tila

# couldNotFetchApiKey.Text
source: Could not fetch API key
fi_fi: API-avainta ei voitu hakea

# disabled.Text
source: disabled
fi_fi: ei käytössä

# email.Text
source: Email
fi_fi: Sähköposti

# enableBluetoothPrompt.Text
source: Do you wish to enable Bluetooth on this device?
fi_fi: Haluatko aktivoida Bluetooth-toiminnallisuuden tällä laitteella?

# enabled.Text
source: enabled
fi_fi: käytössä

# enterApiKey.Text
source: Enter API key
fi_fi: Syötä API-avain

# failedToFetchApiKeyDueToNetworkError.Text
source: Failed to fetch the API key due to a possible network error.
fi_fi: API-avaimen haku epäonnistui yhteysvirheen vuoksi.

# failedToParseServerResponse.Text
source: Failed to parse the server response.
fi_fi: Palvelinvastauksen jäsennys epäonnistui.

# failedToRegisterBackgroundTask.Text
source: Failed to register background task
fi_fi: Tausta-ajon rekisteröinti epäonnistui

# failedToStartWatcher.Text
source: Failed to start Bluetooth LE advertisement watcher
fi_fi: Bluetooth LE advertisement watcher -komponentin käynnistys epäonnistui

# fetchApiKey.Text
source: fetch API key
fi_fi: hae API-avain

# invalid.Text
source: invalid
fi_fi: epäkelpo

# invalidApiKey.Text
source: The API key is invalid.
fi_fi: API-avain ei ole kelvollinen

# invalidOrMissingLayoutError.Text
source: SDK will not be able to resolve beacon actions due to invalid or missing beacon layout. If the API key is valid, check network connectivity.
fi_fi: SDK ei voi selvittää beacon-toimenpiteitä puuttuvan tai epäkelvon beacon layout -tiedon vuoksi. Jos API-avain on kelvollinen, tarkasta verkkoyhteys.

# no.Text
source: no
fi_fi: ei

# notSupported.Text
source: not supported
fi_fi: ei tuettu

# noWindowsCampaignsAvailable.Text
source: No Windows campaigns available.
fi_fi: Ei Windows-kampanjoita saatavilla.

# or.Text
source: - OR -
fi_fi: - TAI -

# password.Text
source: Password
fi_fi: Salasana

# resetToDemoApiKey.Text
source: Reset to demo API key
fi_fi: Palauta demo-API-avain

# scanApiKeyFromQrCode.Text
source: scan API key from QR code
fi_fi: lue API-avain QR-koodista

# scanner.Text
source: scanner
fi_fi: skanneri

# scannerStopped.Text
source: Scanner is stopped
fi_fi: Skanneri on pysäytetty

# scannerWithBeaconCount.Text
source: scanner ({0})
fi_fi: skanneri ({0})

# scanning.Text
source: Scanning...
fi_fi: Skannataan...

# scanningForQrCode.Text
source: scanning for QR code...
fi_fi: etsitään QR-koodia...

# sdkStatusOk.Text
source: SDK status OK
fi_fi: SDK:n tila OK

# settings.Text
source: settings
fi_fi: asetukset

# startAdvertising.Label
source: start advertising
fi_fi: aloita lähetys

# startScanner.Label
source: start scanner
fi_fi: aloita skannaus

# status.Text
source: status
fi_fi: tila

# stopAdvertising.Label
source: stop advertising
fi_fi: pysäytä lähetys

# stopScanner.Label
source: stop scanner
fi_fi: pysäytä skannaus

# supported.Text
source: supported
fi_fi: tuettu

# toggleScanner.Label
source: toggle scanner
fi_fi: vaihda skannerin tila

# unknownApiKeyValidationError.Text
source: Could not validate the API key due to unknown error.
fi_fi: API-avaimen kelvollisuutta ei voitu tarkistaa verkkoyhteyden vuoksi.

# unknownFetchApiKeyError.Text
source: Could not fetch the API key due to unknown error.
fi_fi: API-avaimen tarkistuksessa tapahtui tuntematon virhe.

# updateSuccessful.Text
source: Update successful
fi_fi: Päivitys onnistui

# valid.Text
source: valid
fi_fi: kelvollinen

# yes.Text
source: yes
fi_fi: kyllä
